models/tmr/flatplate/finest/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1.0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            freestreamVelocity;
        freestreamValue uniform (1.0 0 0);
    }
    plate
    {
        type            noSlip;
    }
    bottomSym
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}
