models/tmr/flatplate/finest/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 125;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 125;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 125;
        value           uniform 125;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 125;
        value           uniform 125;
    }
    plate
    {
        type            omegaWallFunction;
        blended         true;
        value           uniform 125;
    }
    bottomSym
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}
